БылковДА_70180166/src/Documents/ИдентификацияАкадемическихЗадолженностей/ИдентификацияАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИдентификацияАкадемическихЗадолженностей</name>
  <basedOn>Document.РезультатыПредыдущихСессий</basedOn>
  <registerRecords>AccumulationRegister.НеудачныеПересдачи</registerRecords>
  <registerRecords>AccumulationRegister.ПросроченныеЗадолженности</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Характеристика</name>
    <attributes>
      <name>Дисциплины</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаКонтроля</name>
      <type>
        <types>EnumRef.НаименованиеКонтроля</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БылковДА_70180166/src/Documents/ИдентификацияАкадемическихЗадолженностей/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт

	Макет = Документы.ИдентификацияАкадемическихЗадолженностей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификацияАкадемическихЗадолженностей.Группа,
	|	ИдентификацияАкадемическихЗадолженностей.Дата,
	|	ИдентификацияАкадемическихЗадолженностей.ЛичныйИндекс,
	|	ИдентификацияАкадемическихЗадолженностей.НаправленияПодготовки,
	|	ИдентификацияАкадемическихЗадолженностей.Номер,
	|	ИдентификацияАкадемическихЗадолженностей.Семестр,
	|	ИдентификацияАкадемическихЗадолженностей.Студент,
	|	ИдентификацияАкадемическихЗадолженностей.Факультет,
	|	ИдентификацияАкадемическихЗадолженностей.ФормаОбучения,
	|	ИдентификацияАкадемическихЗадолженностей.Характеристика.(
	|		НомерСтроки,
	|		Дисциплины,
	|		ФормаКонтроля
	|	)
	|ИЗ
	|	Документ.ИдентификацияАкадемическихЗадолженностей КАК ИдентификацияАкадемическихЗадолженностей
	|ГДЕ
	|	ИдентификацияАкадемическихЗадолженностей.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьХарактеристикаШапка = Макет.ПолучитьОбласть("ХарактеристикаШапка");
	ОбластьХарактеристика = Макет.ПолучитьОбласть("Характеристика");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьХарактеристикаШапка);
		ВыборкаХарактеристика = Выборка.Характеристика.Выбрать();
		Пока ВыборкаХарактеристика.Следующий() Цикл
			ОбластьХарактеристика.Параметры.Заполнить(ВыборкаХарактеристика);
			ТабДок.Вывести(ОбластьХарактеристика, ВыборкаХарактеристика.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры
